import React, { useState } from "react";

const CareInstructions = () => {
  const [open, setOpen] = useState(null);

  const toggle = (type) => setOpen(open === type ? null : type);

  return (
    <section className="care-section fade-in-up">
      <h2 className="section-title">הוראות טיפול</h2>

      <div className="care-container">
        <div className="care-box slide-in">
          <button className="care-btn" onClick={() => toggle("open")}>
            🌿 טרריום פתוח
          </button>
          {open === "open" && (
            <p className="care-text">
              השקיה עדינה אחת לשבועיים, מיקום מואר אך ללא שמש ישירה.
              יש לנקות בעדינות אבק מהעלים במטלית רכה.
            </p>
          )}
        </div>

        <div className="care-box slide-in">
          <button className="care-btn" onClick={() => toggle("closed")}>
            🌱 טרריום סגור
          </button>
          {open === "closed" && (
            <p className="care-text">
              הוראות טיפול לטרריום סגור
<br/>
ברכות על הרכישה! 🌿
הטרריום שלך הוא עולם קטן וסגור.
חי ונושם, שזקוק לטיפול עדין בלבד.
כדי לשמור עליו לאורך זמן, חשוב לעקוב אחרי ההנחיות הבאות:


    <ul>🌤 מיקום ותאורה
        <li>	הנח את הטרריום במקום מואר, אך ללא שמש ישירה.
    שמש חזקה עלולה לגרום לעיבוי מוגזם ולחום שיפגע בצמחים.
       </li><li> 	תאורה עקיפה ליד חלון או תאורה מלאכותית עדינה ואידיאלית.
    </li>
    </ul>

<ul>💧 השקיה ולחות
	<li>	הטרריום הסגור יוצר סביבה לחה טבעית, ולכן אין צורך להשקות לעיתים קרובות.</li>
	<li>	במידה והאדמה נראית יבשה לגמרי, ניתן לרסס מעט מים (2–3 לחיצות קלות).</li>
	<li>	אם יש טיפות מים על דפנות הזכוכית  אל תשקה. זה סימן שיש מספיק לחות.</li>
</ul>
<ul>🌬 אוורור
	<li>	אחת לחודש מומלץ לפתוח את המכסה למשך כשעה עד שעתיים,
כדי לאפשר לאוויר להתחדש ולמנוע עודף עיבוי.</li>
</ul>
<ul>🍃 ניקוי ותחזוקה
	<li>	ניתן לנגב בעדינות את הזכוכית מבחוץ בלבד,
ולהימנע ממגע ישיר עם הצמחים.</li>
	<li>	אם עלים מתייבשים או משחירים, גזום בעדינות את החלק הפגוע בלבד.</li>
	<li>	אין צורך להוסיף דשן , האיזון הפנימי של הטרריום שומר על עצמו.</li>
</ul>
<ul>⚠ טיפים חשובים
	<li>	אל תפתח את הטרריום לעיתים קרובות , זה פוגע באיזון הלחות.</li>
	<li>	שמור אותו הרחק ממקור חום ישיר (רדיאטור, מזגן, תנור וכו׳).</li>
	<li>	במקרה של עובש, השאר את המכסה פתוח ליום עד יומיים והסר את החלק הנגוע בזהירות.</li>
   </ul>       
            </p>
          )}
        </div>
      </div>
    </section>
  );
};

export default CareInstructions;
